; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image0 - mode
	infrared3 - mode
	thermograph1 - mode
	thermograph4 - mode
	thermograph2 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation6 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	GroundStation7 - direction
	GroundStation4 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph4)
	(supports instrument0 infrared3)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(have_image Planet11 image0)
	(have_image Star12 thermograph1)
	(have_image Star13 image0)
	(have_image Star14 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 groundstation6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation6)
   goals met: 1 of 5
3. (turn_to satellite0 groundstation7 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 groundstation7)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 groundstation6 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 groundstation6)
   goals met: 1 of 5
6. (turn_to satellite0 planet11 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet11)
   goals met: 0 of 5
7. (take_image satellite0 planet11 instrument0 image0)
   added: (have_image planet11 image0)
   goals met: 1 of 5
8. (turn_to satellite0 groundstation6 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation6)
   goals met: 2 of 5
9. (turn_to satellite0 star12 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star12)
   goals met: 1 of 5
10. (take_image satellite0 star12 instrument0 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 2 of 5
11. (turn_to satellite0 groundstation6 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation6)
   goals met: 3 of 5
12. (turn_to satellite0 star13 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star13)
   goals met: 2 of 5
13. (take_image satellite0 star13 instrument0 image0)
   added: (have_image star13 image0)
   goals met: 3 of 5
14. (turn_to satellite0 groundstation6 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation6)
   goals met: 4 of 5
15. (turn_to satellite0 star14 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star14)
   goals met: 3 of 5
16. (take_image satellite0 star14 instrument0 image0)
   added: (have_image star14 image0)
   goals met: 4 of 5
17. (turn_to satellite0 groundstation6 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation6)
   goals met: 5 of 5
